Revit 2024 API
Definitions.GetEnumerator Method
Retrieves an enumerator to the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual IEnumerator<Definition> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of Definition)
Visual C++
public:
virtual IEnumerator<Definition^>^ GetEnumerator()
Return Value
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Definitions Class
Autodesk.Revit.DB Namespace